{
  "name": "gyme",
  "imageClass" : "gyme-item",
  "numImages": 3,
  "language": "PHP | HTML/CSS | JS | Kotlin",
  "title": "Gyme",
  "text" : [
    "Gym tracker website designed for weight-lifters to record their performance in the gym and view progress with various analytics.",
    "This is built using PHP with an MVC architecture in a framework I developed from scratch. The front-end is written in HTML/CSS using the W3.CSS responsive framework. Client-side JavaScript is also used for manipulating the DOM based on user interactions.",
    "I have recently redeveloped some of the back-end functionality using Kotlin with Spring Boot. This part of the back-end is fully unit tested using TDD. The decision to redevelop this functionality was due to performance issues.",
    "Spring Boot and Kotlin were used as I plan to develop an accompanying mobile app which will use the same Rest APIs.",
    "The database used in the application is MySQL, which is hosted using AWS Relational Database Service. With both the main PHP application and the new Spring Boot APIs hosted on Heroku.",
    "Users can enter their workout performance on the Workouts page, then can view various analytics based on the corresponding data. Analytics include attendance data, frequency of muscle groups and average weight. Workout suggestions are also created based on past visits."
  ],
  "date" : "Aug 2017",
  "website" : "https://www.gyme.co.uk",
  "category" : "wesbite",
  "techStack" : [
    "PHP",
    "Kotlin",
    "Spring Boot",
    "JavaScript",
    "HTML",
    "CSS",
    "W3.CSS",
    "MySQL",
    "AWS RDS",
    "Heroku"
  ],
  "links": [{
      "icon": "zmdi zmdi-github",
      "url": "https://github.com/cshep4/gyme",
      "text": "Main Codebase"
    },
    {
    "icon": "zmdi zmdi-github",
    "url": "https://github.com/cshep4/gyme_v2",
    "text": "Rewritten APIs"
    }
  ],
  "previous" : {
    "name": "3dgameengine",
    "title": "3D Game Engine"
  },
  "next" : {
    "name": "monsterattack",
    "title": "Monster Attack"
  }
}
