{
  "name": "monsterattack",
  "imageClass" : "monster-attack-item",
  "numImages": 1,
  "language": "Java",
  "title": "Monster Attack",
  "text" : [
    "Shoot 'Em Up mobile game which is based on the theme 'Mutation'. This was originally developed during my final year of University, but has since been redeveloped using the LibGDX engine and Java 8 functions.",
    "As the original version of the app was written using only Java 7, I wanted to incorporate Java 8 features such as functional programming and lambda expressions to clean up the code and improve readability.",
    "The app is fully unit tested. Mockito was used for mocking objects, however due to the implementation of some of the LibGDX features, Powermock was also needed for mocking static LibGDX methods.",
    "The user can control the player movement by swiping and can shoot by pressing the Shoot button. Enemies will continuously spawn from the right hand side of the screen and will run towards the other side. The aim of the game is to kill each enemy before they get to the other side or collide with the player.",
    "As more enemies are killed the difficultly will get harder. As the game is based on mutation, enemies will change and gain more abilities. More powerful enemies will spawn too.",
    "There is a total of ten different types of enemies of differing abilities, some of which will produce other enemies. During the game pickups will also spawn in random places, these include extra lives, shields, extra bullets or bombs.",
    "Unfortunately due to the World Cup and Premier League Predictor apps, I have not had time to fully finish the app and release it, although I am planning on doing this in the near future."
  ],
  "date" : "Mar 2018",
  "category" : "game",
  "techStack" : [
    "Java",
    "Android",
    "iOS",
    "LibGDX",
    "Lombok",
    "Mockito",
    "Powermock"
  ],
  "links": [{
    "icon": "zmdi zmdi-github",
    "url": "https://github.com/cshep4/MonsterAttack_LibGDX"
  }],
  "previous" : {
    "name": "gyme",
    "title": "Gyme"
  },
  "next" : {
    "name": "worldcuppredictor",
    "title": "World Cup Predictor"
  }
}
